Revit 2027 API
ParameterFilterElement.SetCategories Method
 Sets the categories admitted by this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCategories(
	ICollection<ElementId> categories
)
Public Sub SetCategories (
	categories As ICollection(Of ElementId)
)
public:
void SetCategories(
	ICollection<ElementId^>^ categories
)
member SetCategories :
        categories : ICollection<ElementId> -> unit
Parameters
categories ICollection<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
Testing that an element's category is a member of this set is, essentially, the first rule of the filter.
Changing the set of categories will clear any rules that use parameters that are not applicable for the new set of categories.
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace